4.Tesla_Cybertruck_CFD/0/include/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

upperWall
{
    type  noSlip;
}

Front
{
    type  noSlip;
}

Back
{
    type  noSlip;
}
 
lowerWall
{
    type  noSlip;
}
// ************************************************************************* //
