4.Tesla_Cybertruck_CFD/Allrun
#https://github.com/frixlee/openfoam_cases

#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceFeatures

runApplication blockMesh

runApplication snappyHexMesh -overwrite

runApplication pimpleFoam

#------------------------------------------------------------------------------
