4.Tesla_Cybertruck_CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-3 -0.4 -3)
    (17 -0.4 -3)
    (17  4.6 -3)  
    (-3  4.6 -3)
    (-3 -0.4  3)
    (17 -0.4  3)
    (17  4.6  3)
    (-3  4.6  3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 20 24) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    Front
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    Back
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
	(1 5 4 0)            
        );
    }
    upperWall
    {
        type  wall;
        faces
        (
	(3 7 6 2)     
        );
    }
);

// ************************************************************************* //
